# Core
hyprland
xdg-desktop-portal-hyprland
xorg-xwayland
qt6-declarative
qt6-wayland

# Hypr ecosystem
hyprpaper
hyprlock
hypridle

# Bar / shell — Quickshell-based (replaces waybar+mako+rofi)
quickshell
swaync

# Keep waybar around as a fallback bar option (no longer the default)
waybar

# Terminal / editor support
ghostty

# Daily tools
nemo
nemo-fileroller
file-roller
gvfs
network-manager-applet
blueman
pavucontrol
brightnessctl
playerctl
polkit-gnome
power-profiles-daemon
upower

# Screenshots / clipboard
grim
slurp
wl-clipboard
cliphist
hyprshot

# Shell
zsh
starship

# Boot splash
plymouth

# Build / DKMS support
base-devel
dkms
linux-headers

# Fallback kernel — install.sh's lts-kernel stage adds a systemd-boot entry
# pointing at vmlinuz-linux-lts so a broken upgrade of the main kernel
# never strands you without a bootable system.
linux-lts
linux-lts-headers

# Snapshot / rollback (configured by install.sh's backup stage:
# /etc/timeshift/timeshift.json from template + pacman pre-transaction hook
# that snapshots automatically before every Syu).
timeshift

# Sync helper
rsync

# Optional but useful
ttf-jetbrains-mono-nerd
ttf-manrope
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
ttf-font-awesome
hunspell-ru
aspell-ru
lm_sensors
btop
fastfetch

# Clean theming
nwg-look
adw-gtk-theme
papirus-icon-theme
qt5ct
qt6ct
kvantum
